Tekla Open API Reference for Tekla Structures 2025
AssemblyDrawing Constructor (Identifier, Int32, String)
 Instantiates a new assembly drawing with given attributes and with a specified sheet number.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AssemblyDrawing(
	Identifier assemblyIdentifier,
	int sheetNumber,
	string AttributeFile
)
Public Sub New (
	assemblyIdentifier As Identifier,
	sheetNumber As Integer,
	AttributeFile As String
)
Parameters
assemblyIdentifier
Type: Tekla.Structures.Identifier
The identifier of the model object assembly
sheetNumber
Type: System.Int32
The sheet number of the drawing.
AttributeFile
Type: System.String
The filename of the attributes file.
See Also
Reference
AssemblyDrawing Class
AssemblyDrawing Overload
Tekla.Structures.Drawing Namespace